app/controllers/books_controller.rb

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
UPDATE "books" SET "title" = ?, "body" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["title", "sa"], ["body", "sa"], ["updated_at", "2020-04-25 09:11:42.009293"], ["id", 6]]
---
  def update
      book = Book.find(params[:id])
      book.update(book_params)

SELECT "books".* FROM "books"
INSERT INTO "books" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "a"], ["body", "a"], ["created_at", "2020-04-25 10:29:46.754245"], ["updated_at", "2020-04-25 10:29:46.754245"]]
---
  def create
      @book = Book.new(book_params)
      @books = Book.all
      if @book.save